[
    {
        "name": "ІНЖУ",
        "meaning": "Инжу — казахское и тюркское женское имя, означающее «жемчужина». Происходит от персидского слова «īnchū» или «injü», также означающего жемчужину, и символизирует чистоту, красоту и драгоценность в казахской культуре."
    },
    {
        "name": "ІҢКӘР",
        "meaning": "Иңкәр — казахское имя тюркского происхождения, означающее «любовь» или «нежность». Несёт романтический или трогательный оттенок и в основном используется для девочек в Казахстане, отражая эмоциональное тепло и искренность."
    },
    {
        "name": "АДИНА",
        "meaning": "Адина — имя семитского происхождения, означающее «нежная» или «мягкая», встречающееся как в иврите, так и в арабском языке. Также используется в Центральной Азии, где сочетается с местными традициями и сохраняет то же изящное значение."
    },
    {
        "name": "АДИЯ",
        "meaning": "Адия — имя арабского происхождения, означающее «дар» или «возвращение». В Центральной Азии употребляется в мусульманских семьях и выражает чувство благословения или благодарности."
    },
    {
        "name": "АИДА",
        "meaning": "Аида — арабского происхождения, означает «возвращающаяся» или «гостья». Распространена в мусульманском мире и постсоветских странах. Получила дополнительную известность благодаря опере Верди, сделавшей имя знакомым во многих языках."
    },
    {
        "name": "АИША",
        "meaning": "Аиша — арабское имя, означающее «живая» или «ожившая». Известно как имя жены пророка Мухаммада. Широко используется в странах с мусульманским большинством, включая Центральную Азию, благодаря своему историческому и духовному значению."
    },
    {
        "name": "АЙАРУ",
        "meaning": "Айару — современное казахское женское имя, составленное из «ай» (луна) и «ару» (красивая девушка или дева). Имя означает «лунная красота» и символизирует чистоту, грацию и природное изящество."
    },
    {
        "name": "АЙГЕРІМ",
        "meaning": "Айгерим — казахское имя, образованное от «ай» (луна) и «герим» (красивая, грациозная), означающее «лунная красота». Стало культурно значимым благодаря поэзии Абая Кунанбаева, посвящённой его возлюбленной по имени Айгерим."
    },
    {
        "name": "АЙГЕРИМ",
        "meaning": "Айгерим — вариант написания имени Айгерим, распространённый в Казахстане и среди тюркоязычных народов. Передаёт то же значение — «лунная красота» — и олицетворяет поэтическую женственность в казахской культуре."
    },
    {
        "name": "АЙГУЛ",
        "meaning": "Айгул — тюркское имя, сочетающее «ай» (луна) и «гул» (цветок), то есть «лунный цветок». Распространено среди тюркоязычных народов и символизирует красоту и нежность при лунном свете."
    },
    {
        "name": "АЙГУЛЬ",
        "meaning": "Айгуль (с русским написанием «Айгуль») имеет то же значение, что и Айгул — «лунный цветок». Мягкий знак в конце отражает влияние русской орфографии в советский период."
    },
    {
        "name": "АЙДАНА",
        "meaning": "Айдана — казахское и тюркское имя, означающее «мудрая, как луна» или «лунный разум». Состоит из «ай» (луна) и «дана» (мудрая женщина), символизируя интеллект и чистоту."
    },
    {
        "name": "АЙЖАН",
        "meaning": "Айжан — популярное казахское имя, объединяющее «ай» (луна) и «жан» (душа), то есть «лунная душа» или «чистая душа». Олицетворяет внутреннюю красоту и эмоциональное тепло."
    },
    {
        "name": "АЙЗЕРЕ",
        "meaning": "Айзере — современное казахское имя, происходящее от «ай» (луна) и «зере» (золото или драгоценность), и означающее примерно «драгоценная луна». Подчёркивает изысканность и ценность."
    },
    {
        "name": "АЙКӨРКЕМ",
        "meaning": "Айкөркем — казахское имя, состоящее из «ай» (луна) и «көркем» (красивая, грациозная). Означает «красива, как луна», подчёркивая эстетическую и нравственную красоту."
    },
    {
        "name": "АЙЛИН",
        "meaning": "Айлин — имя турецкого происхождения, означающее «лунный свет». Распространено в Турции, а также в Центральной Азии и Восточной Европе, символизируя спокойствие и умиротворение."
    },
    {
        "name": "АЙНУР",
        "meaning": "Айнур — тюркское имя, сочетающее «ай» (луна) и «нур» (свет — араб.), то есть «лунный свет». Широко используется среди тюркских и мусульманских народов благодаря своей светлой и поэтичной образности."
    },
    {
        "name": "АЙСАНА",
        "meaning": "Айсана — казахское женское имя, означающее «луна и слава» или «благородная луна». Объединяет «ай» (луна) и «сана» (честь, мысль), передавая достоинство и изящество."
    },
    {
        "name": "АЙСАФИ",
        "meaning": "Айсафи, по-видимому, редкое современное имя, сочетающее «ай» (луна) и, возможно, «сафи» (чистый — араб.). Означало бы «чиста, как луна», объединяя тюркские и арабские элементы."
    },
    {
        "name": "АЙША",
        "meaning": "Айша (казах. Айша) сохраняет арабское значение «живая». Остаётся одним из самых распространённых женских имён в мусульманских общинах благодаря своему историческому и духовному значению."
    },
    {
        "name": "АЙЫМ",
        "meaning": "Айым — казахское имя, означающее «моя луна» или «лунная госпожа». Выражает привязанность и восхищение, часто используется как ласковое и поэтическое обращение."
    },
    {
        "name": "АЛЕКСАНДРА",
        "meaning": "Александра — славянская женская форма имени Александр, происходящая от греческого и означающая «защитница людей». Классическое имя в Восточной Европе и России, часто сокращается до Саша или Шура."
    },
    {
        "name": "АЛИНА",
        "meaning": "Алина — славянского и, возможно, германского происхождения, означает «светлая» или «благородная». Популярна в России, Польше и Центральной Азии благодаря простому и изящному звучанию."
    },
    {
        "name": "АЛИЯ",
        "meaning": "Алия — арабского происхождения, означает «возвышенная» или «благородная». Широко используется в мусульманских культурах и Центральной Азии; транслитерируется как Алия или Алиа в зависимости от языковых норм."
    },
    {
        "name": "АЛЛА",
        "meaning": "Алла — славянское имя, возможно, от греческого «allos» — «другой», или от древнееврейского корня со значением «дуб». Было популярно в России и Украине, особенно в XX веке."
    },
    {
        "name": "АЛТЫНАЙ",
        "meaning": "Алтынай — казахское имя, означающее «золотая луна», от «алтын» (золото) и «ай» (луна). Символизирует сияние, богатство и вечную красоту."
    },
    {
        "name": "АЛЬБИНА",
        "meaning": "Альбина происходит от латинского «albus» — «белый» или «светлый». Распространилась в славянских странах, где символизирует чистоту и ясность."
    },
    {
        "name": "АМАНКУЛЬ",
        "meaning": "Аманкуль — традиционное казахское и киргизское имя, объединяющее «аман» (мир) и «куль» (озеро), то есть «мирное озеро». Может также означать спокойствие или безопасность."
    },
    {
        "name": "АМИНА",
        "meaning": "Амина — арабское имя, означающее «надёжная» или «честная». Известно как имя матери пророка Мухаммада. Распространено в мусульманских регионах, включая Центральную Азию."
    },
    {
        "name": "АНАР",
        "meaning": "Анар означает «гранат» на персидском и тюркских языках. Символизирует плодородие, красоту и процветание; используется как мужское, так и женское имя в Центральной Азии и Азербайджане."
    },
    {
        "name": "АНАСТАСИЯ",
        "meaning": "Анастасия — имя греческого происхождения, означающее «воскресение». Одно из самых любимых имён в православных культурах, распространено в России, Украине и на Балканах."
    },
    {
        "name": "АНГЕЛИНА",
        "meaning": "Ангелина происходит от греческого «angelos» — «вестник» или «ангел». Распространена в славянских странах, ассоциируется с добротой и духовной благодатью."
    },
    {
        "name": "АНЕЛЬ",
        "meaning": "Анель — современное казахское имя, вероятно, от «ана» (мать) и ласкового суффикса «-ель», то есть «любимая мама» или «дорогая». Короткое, мягкое и современное по звучанию."
    },
    {
        "name": "АННА",
        "meaning": "Анна — классическое библейское имя от иврита «Ханна», означающее «благодать» или «милость». Одно из самых универсальных женских имён в христианских культурах, включая славянские регионы."
    },
    {
        "name": "АНТОНИНА",
        "meaning": "Антонина — женская форма римского имени Антоний, означающего «бесценная» или «неоценимая». Широко использовалась в Восточной Европе и России, часто сокращается до Тоня."
    },
    {
        "name": "АРАЙЛЫМ",
        "meaning": "Арайлым — казахское имя, объединяющее «арай» (луч или заря) и ласковый суффикс «-лым», то есть «мой свет» или «моя заря». Вызывает ассоциации с теплом, обновлением и нежностью."
    },
    {
        "name": "АРИНА",
        "meaning": "Арина — русский вариант имени Ирина, от греческого «Эйрена» — «мир». Стала распространённой в России и Беларуси как традиционное, но мягкое по звучанию имя."
    },
    {
        "name": "АРУЖАН",
        "meaning": "Аружан — казахское имя, означающее «чистая душа» или «благородный дух», от «ару» (чистая) и «жан» (душа). Олицетворяет доброту и внутреннюю красоту."
    },
    {
        "name": "АСЕЛЬ",
        "meaning": "Асель (или Ассель) — казахское имя, означающее «мёд», и символизирующее сладость и доброту. Происходит от арабского «асаль» и популярно в Центральной Азии."
    },
    {
        "name": "АСЫЛЫМ",
        "meaning": "Асылым — казахское имя, образованное от «асыл» (драгоценный, благородный) и «-ым» (мой), то есть «моя драгоценность». Выражает глубокую привязанность и уважение."
    },
    {
        "name": "АЯЖАН",
        "meaning": "Аяжан — казахское имя, объединяющее «ая» (чистая или луна) и «жан» (душа), то есть «чистая душа». Ценится за нежный и духовный оттенок."
    },
    {
        "name": "АЯЛА",
        "meaning": "Аяла — казахское имя, означающее «заботиться» или «беречь». Подчёркивает нежность, сочувствие и защиту, отражая семейную привязанность."
    },
    {
        "name": "АЯНА",
        "meaning": "Аяна — имя тюркского и африканского происхождения. В казахском языке означает «осознание» или «ясность», а в других культурах — «прекрасный цветок»."
    },
    {
        "name": "АЯНАТ",
        "meaning": "Аянат, по-видимому, современное казахское имя, возможно, от «аяна» (знак, откровение). Намекает на духовное понимание или божественное прозрение."
    },
    {
        "name": "АЯУЛЫМ",
        "meaning": "Аяулым — казахское имя, объединяющее «аяу» (беречь) и «-лым» (мой), то есть «моя дорогая» или «моя любимая». Передаёт тепло и нежность."
    },
    {
        "name": "АҚБОТА",
        "meaning": "Ақбота означает «белый верблюжонок» на казахском языке и символизирует невинность и удачу. Это традиционное и ласковое женское имя в казахской культуре."
    },
    {
        "name": "АҚЕРКЕ",
        "meaning": "Ақерке — казахское имя, объединяющее «ақ» (белый, чистый) и «ерке» (нежная, любимая). Означает «чистая и нежная» или «невинная любимая»."
    },
    {
        "name": "БИБИГУЛЬ",
        "meaning": "Бибигуль — имя персидского происхождения, означающее «госпожа цветов» или «цветочная женщина», от «биби» (госпожа) и «гуль» (цветок). Распространено в Центральной Азии, ассоциируется с красотой и изысканностью; известно благодаря казахской певице Бибигуль Тулегеновой."
    },
    {
        "name": "ВАЛЕНТИНА",
        "meaning": "Валентина — славянское имя латинского происхождения, означающее «сильная» или «здоровая». Женская форма имени Валентин, широко распространена в России, Украине и Восточной Европе."
    },
    {
        "name": "ВАЛЕРИЯ",
        "meaning": "Валерия происходит от латинского «valere» — «быть сильной» или «здоровой». Популярна в России и Восточной Европе, часто сокращается до Лера."
    },
    {
        "name": "ВЕРА",
        "meaning": "Вера — славянское имя, означающее «вера» или «истина». Имеет христианские корни и символизирует моральную силу и доверие, распространено в России и на Балканах."
    },
    {
        "name": "ВИКТОРИЯ",
        "meaning": "Виктория происходит от латинского «victoria» — «победа». Ассоциируется с триумфом и успехом и остаётся классическим женским именем во всей Восточной Европе."
    },
    {
        "name": "ГАЛИНА",
        "meaning": "Галина — имя греческого происхождения, означающее «спокойная» или «безмятежная». Вошло в славянскую традицию через православие и было популярно в России и Украине в XX веке."
    },
    {
        "name": "ГАЛИЯ",
        "meaning": "Галия — имя тюркского и арабского происхождения, означающее «драгоценная» или «ценная». Употребляется у татар, казахов и башкир, выражая привязанность и уважение."
    },
    {
        "name": "ГУЛЬЖАН",
        "meaning": "Гульжан — казахское и тюркское имя, объединяющее «гуль» (цветок) и «жан» (душа), то есть «цветочная душа». Выражает внутреннюю красоту и жизнерадостность."
    },
    {
        "name": "ГУЛЬМИРА",
        "meaning": "Гульмира — персидского происхождения, от «гуль» (цветок) и «мира» (принцесса или мир), то есть «принцесса цветов» или «мирный цветок». Популярно в Центральной Азии."
    },
    {
        "name": "ГУЛЬНАР",
        "meaning": "Гульнар происходит от персидского «gul-i nar» — «гранатовый цветок». Символизирует жизненную силу и плодородие, распространено в тюркских и персидскоязычных регионах."
    },
    {
        "name": "ГУЛЬНАРА",
        "meaning": "Гульнара — более длинная форма имени Гульнар с тем же значением «гранатовый цветок». Широко использовалась в Центральной Азии и на Кавказе под персидским влиянием."
    },
    {
        "name": "ДАНА",
        "meaning": "Дана — имя персидского и тюркского происхождения, означающее «мудрая» или «учёная». Распространено в Казахстане, отражает интеллект и здравый смысл."
    },
    {
        "name": "ДАРЬЯ",
        "meaning": "Дарья происходит от персидского «дарья» — «море». Была заимствована в славянские языки и символизирует глубину, простор и спокойствие."
    },
    {
        "name": "ДИАНА",
        "meaning": "Диана — латинское имя, связанное с римской богиней луны и охоты. Стала популярной как в христианских, так и в мусульманских обществах, символизируя чистоту и независимость."
    },
    {
        "name": "ДИЛЬНАЗ",
        "meaning": "Дильназ происходит от персидских корней «дил» (сердце) и «наз» (нежность, очарование), то есть «очаровательное сердце». Популярно в Центральной Азии, вызывает чувство привязанности."
    },
    {
        "name": "ДИНАРА",
        "meaning": "Динара — арабского происхождения, означает «золотая монета» или «ценная». Распространилась через мусульманские культуры и является распространённым женским именем в Казахстане и Узбекистане."
    },
    {
        "name": "ЕВГЕНИЯ",
        "meaning": "Евгения — греческого происхождения, означает «благородного происхождения». Традиционное русское и восточноевропейское имя, часто сокращается до Женя."
    },
    {
        "name": "ЕВДОКИЯ",
        "meaning": "Евдокия — православное имя греческого происхождения, означающее «благоволение» или «милость». Ранее было популярно в России и Болгарии, отражает благочестие и доброту."
    },
    {
        "name": "ЕКАТЕРИНА",
        "meaning": "Екатерина — греческого происхождения, означает «чистая». Царственное имя, носимое русскими императрицами, часто сокращается до Катя."
    },
    {
        "name": "ЕЛЕНА",
        "meaning": "Елена — славянская форма имени Елена, означающая «свет» или «факел». Символизирует сияние и красоту, распространена по всей Восточной Европе."
    },
    {
        "name": "ЕЛИЗАВЕТА",
        "meaning": "Елизавета — русская форма имени Елизавета, означающая «Бог — моя клятва». Несёт царственные ассоциации и остаётся традиционным и изящным."
    },
    {
        "name": "ЖАДЫРА",
        "meaning": "Жадыра — казахское имя, означающее «радостная» или «сияющая». Отражает живость и оптимизм в характере."
    },
    {
        "name": "ЖАЗИРА",
        "meaning": "Жазира означает «степь» или «простор» на казахском языке и символизирует открытость, свободу и природную красоту, характерную для казахского ландшафта."
    },
    {
        "name": "ЖАНАР",
        "meaning": "Жанар — казахское имя, означающее «обновлять» или «сиять». Также относится к «искрящимся глазам», символизируя живость и ясность."
    },
    {
        "name": "ЖАНАТ",
        "meaning": "Жанат — казахское имя, означающее «рай» или «небеса». Несёт коннотации чистоты, счастья и духовной благодати."
    },
    {
        "name": "ЖАНЕРКЕ",
        "meaning": "Жанерке объединяет «жан» (душа) и «ерке» (любимая, игривая), то есть «любимая душа» или «дорогая». Звучит ласково и тепло."
    },
    {
        "name": "ЖАНИЯ",
        "meaning": "Жания — казахское имя, образованное от «жан» (душа) с мягким суффиксом, означает «душевная» или «добросердечная». Передаёт нежность и сочувствие."
    },
    {
        "name": "ЖАННА",
        "meaning": "Жанна — русская и казахская форма имени Жанна (Жанна д’Арк), означающая «Бог благословил». Стала популярной в советский и постсоветский периоды."
    },
    {
        "name": "ЖАНСАЯ",
        "meaning": "Жансая — казахское имя, означающее «душа благодати» или «нежная душа». Отражает доброту, сочувствие и спокойствие."
    },
    {
        "name": "ЖАСМИН",
        "meaning": "Жасмин — казахская транслитерация имени Жасмин, персидского происхождения, означающего «цветок жасмина». Символизирует красоту и чистоту."
    },
    {
        "name": "ЗАРИНА",
        "meaning": "Зарина — имя персидского происхождения, означающее «золотая» или «царственная». Исторически носила скифская принцесса, остаётся популярным в Центральной Азии."
    },
    {
        "name": "ЗЕРЕ",
        "meaning": "Зере — казахское имя, означающее «умная» или «мудрая женщина». Ценится за ассоциацию с интеллектом и достоинством."
    },
    {
        "name": "ЗИНАИДА",
        "meaning": "Зинаида — славянское имя греческого происхождения, означающее «дочь Зевса». Традиционно в России и Болгарии, часто сокращается до Зина."
    },
    {
        "name": "ЗОЯ",
        "meaning": "Зоя — греческого происхождения, означает «жизнь». Христианское имя, символизирующее жизненную силу и духовное обновление, широко используется в славянских странах."
    },
    {
        "name": "ИНАБАТ",
        "meaning": "Инабат — казахское и узбекское имя арабского происхождения, означающее «смирение» или «послушание». Ценится за духовные и нравственные коннотации."
    },
    {
        "name": "ИНДИРА",
        "meaning": "Индира — санскритское имя, означающее «красота» или «великолепие», также эпитет богини Лакшми. Стало известно благодаря Индире Ганди и иногда используется в Центральной Азии."
    },
    {
        "name": "ИРИНА",
        "meaning": "Ирина — имя греческого происхождения, означающее «мир», от Эйрены. Одно из самых распространённых женских имён в Восточной Европе и России."
    },
    {
        "name": "КАМИЛА",
        "meaning": "Камила — арабского и латинского происхождения, означает «совершенная» или «цельная». Распространена как в мусульманских, так и в славянских обществах, символизируя добродетель и грацию."
    },
    {
        "name": "КАРИНА",
        "meaning": "Карина — латинского и итальянского происхождения, означает «любимая» или «чистая». Стала популярной в России и Центральной Азии как современное по звучанию имя."
    },
    {
        "name": "КАРЛЫГАШ",
        "meaning": "Карлыгаш означает «ласточка» на казахском языке. Символизирует счастье, возвращение и надежду, отражая казахские народные верования о ласточке как вестнице весны."
    },
    {
        "name": "КРИСТИНА",
        "meaning": "Кристина — славянская и европейская форма имени Кристина, означающая «последовательница Христа». Остаётся распространённым именем в России, Беларуси и Украине."
    },
    {
        "name": "КСЕНИЯ",
        "meaning": "Ксения — греческого происхождения, означает «гостеприимная» или «приветливая». Ассоциируется со святой Ксенией Петербургской и остаётся уважаемым православным именем."
    },
    {
        "name": "КУЛЯШ",
        "meaning": "Куляш — казахское имя персидско-тюркского происхождения, означающее «цветущая» или «подобная цветку». Популяризировано казахской оперной певицей Куляш Байсеитовой."
    },
    {
        "name": "КӘУСАР",
        "meaning": "Кәусар (араб. Кавсар) — исламское имя, означающее «изобилие» или «река в раю», упомянутое в Коране. Символизирует божественное благословение и щедрость."
    },
    {
        "name": "КӨЗАЙЫМ",
        "meaning": "Көзайым означает «мои прекрасные глаза» на казахском языке, от «көз» (глаз) и «айым» (моя луна или дорогая). Выражает привязанность и восхищение."
    },
    {
        "name": "КӨРКЕМ",
        "meaning": "Көркем — казахское слово, означающее «красивая» или «художественная». Как имя обозначает как внешнюю красоту, так и эстетическое чувство."
    },
    {
        "name": "ЛАРИСА",
        "meaning": "Лариса — греческого происхождения, от названия древнего фессалийского города, означающего «цитадель». Стала популярным женским именем в России и Восточной Европе."
    },
    {
        "name": "ЛАУРА",
        "meaning": "Лаура происходит от латинского «laurus» — «лавр» или «победа». Символизирует честь и успех, используется по всей Европе и в Центральной Азии."
    },
    {
        "name": "ЛИДИЯ",
        "meaning": "Лидия происходит от греческого имени женщины из Лидии — древнего региона в Малой Азии. Символизирует благородство и была популярна в православных культурах."
    },
    {
        "name": "ЛЮБОВЬ",
        "meaning": "Любовь означает «любовь» по-русски и является одним из традиционных христианских имён-добродетелей. Отражает эмоциональное тепло и веру."
    },
    {
        "name": "ЛЮДМИЛА",
        "meaning": "Людмила — славянское имя, означающее «милая народу», от «люд» (народ) и «мила» (милая). Олицетворяет доброту и популярность."
    },
    {
        "name": "МАДИНА",
        "meaning": "Мадина — арабского происхождения, означает «город» или «священный город», имея в виду Медину в Саудовской Аравии. Широко используется как мусульманское имя, символизирующее веру и святость."
    },
    {
        "name": "МАЙРА",
        "meaning": "Майра имеет смешанное происхождение: в арабском — «любимая», а в казахском иногда связывается с «маем» или весной. Передаёт привязанность и обновление."
    },
    {
        "name": "МАКПАЛ",
        "meaning": "Макпал — казахское имя, означающее «бархат». Символизирует мягкость, нежность и изысканность."
    },
    {
        "name": "МАЛИКА",
        "meaning": "Малика — арабское имя, означающее «королева». Обозначает благородство и лидерство, распространено в мусульманских культурах Центральной Азии."
    },
    {
        "name": "МАРИНА",
        "meaning": "Марина — латинского происхождения, означает «морская». Распространилась по христианской Европе и России, вызывает ассоциации с безмятежностью и глубиной."
    },
    {
        "name": "МАРИЯ",
        "meaning": "Мария — славянская форма имени Мария, от иврита «Мириам», означающего «любимая» или «желанное дитя». Имеет сильные библейские и культурные ассоциации."
    },
    {
        "name": "МАРИЯМ",
        "meaning": "Мариям — арабская форма имени Мария, широко используемая в мусульманских общинах. Имеет то же значение — «любимая» или «посвящённая Богу»."
    },
    {
        "name": "МЕДИНА",
        "meaning": "Медина — арабское имя, означающее «город», и относится к священному городу в исламе. Популярно в мусульманских регионах благодаря своему религиозному значению."
    },
    {
        "name": "МЕРЕЙ",
        "meaning": "Мерей — казахское имя, означающее «честь» или «престиж». Отражает социальное уважение, достоинство и гордость."
    },
    {
        "name": "МЕРУЕРТ",
        "meaning": "Меруерт означает «жемчужина» на казахском языке, заимствовано из персидского «морварид». Символизирует чистоту и красоту и является классическим женским именем."
    },
    {
        "name": "МИЛАНА",
        "meaning": "Милана — славянского и, возможно, итальянского происхождения, означает «благодатная» или «милая». Стала современным и изящным именем в Восточной Европе."
    },
    {
        "name": "МОЛДИР",
        "meaning": "Молдир — казахское имя, означающее «чистая» или «прозрачная», часто описывает кристально чистую воду. Передаёт чистоту и искренность."
    },
    {
        "name": "МӘРИЯМ",
        "meaning": "Мәриям — казахская транслитерация имени Мариям, арабской формы имени Мария. Означает «любимая» и несёт глубокое религиозное уважение."
    },
    {
        "name": "МӨЛДІР",
        "meaning": "Мөлдір означает «чистая» или «прозрачная» на казахском языке, часто относится к чистой воде или невинности. Отражает ясность духа и честность."
    },
    {
        "name": "НАДЕЖДА",
        "meaning": "Надежда — славянское имя, означающее «надежда». Одно из традиционных христианских имён-добродетелей, остаётся распространённым и уважаемым в России и Восточной Европе."
    },
    {
        "name": "НАЗЕРКЕ",
        "meaning": "Назерке — казахское имя, объединяющее «наз» (грация, очарование) и «ерке» (любимая, нежная), то есть «очаровательная любимая». Подчёркивает изящество и привязанность."
    },
    {
        "name": "НАТАЛЬЯ",
        "meaning": "Наталья происходит от латинского «natalis» — «рождённая» или «рождённая на Рождество». Классическое и прочное имя в славянских странах."
    },
    {
        "name": "НИНА",
        "meaning": "Нина имеет несколько происхождений: в славянском употреблении — от грузинского, означает «мечтательница» или «благодать»; в испанском — «девочка». Короткое, тёплое и широко используемое."
    },
    {
        "name": "НҰРАЙ",
        "meaning": "Нурай — казахское и тюркское имя от «нур» (свет) и «ай» (луна), означающее «лунный свет» или «сияющая луна». Обозначает красоту и духовное сияние."
    },
    {
        "name": "ОКСАНА",
        "meaning": "Оксана — украинский вариант имени Ксения, означающий «гостеприимная». Хорошо известна в Восточной Европе и часто символизирует открытость и щедрость."
    },
    {
        "name": "ОЛЕСЯ",
        "meaning": "Олеся — славянского происхождения, вероятно, от «лес», означает «девушка из леса». Передаёт природность, независимость и спокойный дух."
    },
    {
        "name": "ОЛЬГА",
        "meaning": "Ольга происходит от древнескандинавского «Helga» — «святая» или «благословенная». Вошла в славянскую традицию через христианизацию Киевской Руси."
    },
    {
        "name": "РАИСА",
        "meaning": "Раиса — арабского и еврейского происхождения, означает «лидер» или «вождь». Также существовала в русском употреблении как изысканное, благородное по звучанию имя."
    },
    {
        "name": "РАЙАНА",
        "meaning": "Раяна — арабское имя, означающее «врата рая» или «освежающая». Используется в мусульманских культурах и символизирует духовную награду и обновление."
    },
    {
        "name": "РАУШАН",
        "meaning": "Раушан — персидское и казахское имя, означающее «светлая» или «сияющая». Выражает свет, ясность и позитивную энергию."
    },
    {
        "name": "РАЯНА",
        "meaning": "Раяна — вариант имени Раяна, с тем же арабским корнем, означающим «врата рая». Несёт коннотации чистоты и божественного благоволения."
    },
    {
        "name": "РОЗА",
        "meaning": "Роза происходит от латинского «rosa» — «роза». Символизирует красоту и любовь, популярна в славянских и тюркских регионах."
    },
    {
        "name": "САБИНА",
        "meaning": "Сабина происходит от латинского «сабинская женщина», относясь к древнему итальянскому племени. Передаёт достоинство и традицию, распространена в Восточной Европе."
    },
    {
        "name": "САЛТАНАТ",
        "meaning": "Салтанат — имя арабского происхождения, означающее «великолепие» или «величие». В казахском языке часто обозначает торжество, радость или праздничность."
    },
    {
        "name": "САРА",
        "meaning": "Сара (или Сарра) — еврейское имя, означающее «княгиня». Распространено как в христианских, так и в мусульманских традициях и символизирует благородство и доброту."
    },
    {
        "name": "САУЛЕ",
        "meaning": "Сауле — казахское имя, означающее «солнце» или «солнечный свет». Символизирует тепло, яркость и жизнь, отражая оптимизм и энергию."
    },
    {
        "name": "САФИЯ",
        "meaning": "Сафия — арабское имя, означающее «чистая» или «искренний друг». Ценится в мусульманских культурах за духовные и нравственные ассоциации."
    },
    {
        "name": "СВЕТЛАНА",
        "meaning": "Светлана — славянское имя, означающее «светлая» или «сияющая». Широко использовалась в России и символизирует чистоту, ясность и свет."
    },
    {
        "name": "СЕЗІМ",
        "meaning": "Сезім — казахское имя, означающее «чувство» или «эмоция». Передаёт чувствительность, сочувствие и внутреннюю глубину."
    },
    {
        "name": "СОФИЯ",
        "meaning": "София (Софья) — греческое имя, означающее «мудрость». Имеет сильные христианские корни и остаётся одним из самых распространённых имён в мире."
    },
    {
        "name": "СЫМБАТ",
        "meaning": "Сымбат — казахское имя, означающее «изящество» или «утонённая красота». Описывает грацию как во внешности, так и в характере."
    },
    {
        "name": "ТАМАРА",
        "meaning": "Тамара — еврейское имя, означающее «финиковая пальма». Стала популярной в православных славянских регионах и символизирует плодородие и жизненную силу."
    },
    {
        "name": "ТАТЬЯНА",
        "meaning": "Татьяна — римского происхождения, от «Татианус», означает «принадлежащая роду Тациев». Классическое русское имя, часто сокращается до Таня."
    },
    {
        "name": "ТАҢШОЛПАН",
        "meaning": "Таншолпан — казахское имя, означающее «утренняя звезда» или «утренняя Венера», символизирующее новые начинания и красоту."
    },
    {
        "name": "ТОМИРИС",
        "meaning": "Томирис отсылает к царице Томирис — древней сакской правительнице. Имя символизирует силу, лидерство и историческую гордость в Центральной Азии."
    },
    {
        "name": "ФАРИЗА",
        "meaning": "Фарида — арабское имя, означающее «обязанность» или «долг». Также несёт коннотации благородства и известно в Казахстане благодаря поэтессе Фаризе Онгарсыновой."
    },
    {
        "name": "ФАТИМА",
        "meaning": "Фатима — арабское имя, означающее «воздержанная» или «целомудренная», известно как имя дочери пророка Мухаммада. Глубоко почитается в исламской традиции."
    },
    {
        "name": "ХАДИША",
        "meaning": "Хадиша (от араб. Хадиджа) означает «преждевременно рождённая» или «ранняя». Почитает первую жену пророка Мухаммада, символизируя верность и преданность."
    },
    {
        "name": "ХАДИЯ",
        "meaning": "Хадия — арабского происхождения, означает «дар» или «подарок». Отражает благодарность и божественное благословение, популярна в мусульманских семьях."
    },
    {
        "name": "ШОЛПАН",
        "meaning": "Шолпан — казахское имя, означающее «Венера» или «утренняя звезда». Ассоциируется со светом, зарёй и красотой в казахском фольклоре."
    },
    {
        "name": "ЭЛЬМИРА",
        "meaning": "Эльмира — имя испанского и арабского происхождения, означающее «принцесса» или «благородная госпожа». Стала распространённой в России и Центральной Азии благодаря изящному звучанию."
    },
    {
        "name": "ЮЛИЯ",
        "meaning": "Юлия — латинского происхождения, означает «молодая». Широко используется в славянских странах и ассоциируется с жизненной силой и обаянием."
    },
    {
        "name": "ЯСИНА",
        "meaning": "Ясина — редкое имя арабского происхождения, происходящее от «Ясин» — коранической суры, символизирующей духовное благословение и руководство."
    },
    {
        "name": "ЯСМИНА",
        "meaning": "Ясмина происходит от «жасмин» — цветка персидского происхождения, символизирующего чистоту, красоту и привязанность. Популярна в Центральной Азии и на Ближнем Востоке."
    },
    {
        "name": "ҚАРАҚАТ",
        "meaning": "Қарақат означает «чёрная смородина» на казахском языке. Это имя, вдохновлённое природой, отражает жизненную силу, сладость и связь с землёй."
    },
    {
        "name": "ӘЙГЕРІМ",
        "meaning": "Әйгерім — казахское написание имени Айгерим, означающее «красива, как луна». Одно из самых поэтичных и традиционных казахских женских имён."
    },
    {
        "name": "ӘМИНА",
        "meaning": "Әмина — казахская форма имени Амина, означающая «надёжная» или «честная». Является одновременно традиционным и религиозно значимым в исламской культуре."
    },
    {
        "name": "ӘСЕЛ",
        "meaning": "Әсел означает «мёд» на казахском языке и символизирует сладость, тепло и доброту. Классическое и ласковое женское имя в Казахстане."
    }
]